import 'package:hive/hive.dart';

part 'bookmark_model.g.dart';

@HiveType(typeId: 0)
class BookmarkModel {
  @HiveField(0)
  final String text;

  @HiveField(1)
  final String type; // "surah", "hadith", "zhkar"

  @HiveField(2)
  final String audio;

  BookmarkModel({
    required this.text,
    required this.type,
    required this.audio,
  });

  factory BookmarkModel.fromJson(Map<String, dynamic> json) {
    return BookmarkModel(
      text: json['text'] as String,
      type: json['type'] as String,
      audio: json['audio'] as String,
    );
  }

  Map<String, dynamic> toJson() {
    return {
      'text': text,
      'type': type,
      'audio': audio,
    };
  }

  static List<BookmarkModel> dummyBookmarks = [
    BookmarkModel(
      text:
          "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.",
      type: "zhkar",
      audio: "Audio_1",
    ),
    BookmarkModel(
      text: "ٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ",
      type: "surah",
      audio: "audios/quran_audio/001/002.mp3",
    ),
    BookmarkModel(
      text:
          "‏ ‏حَدَّثَنَا ‏ ‏مُحَمَّدُ بْنُ إِسْمَعِيلَ ‏ ‏حَدَّثَنَا ‏ ‏مَالِكُ بْنُ إِسْمَعِيلَ ‏ ‏عَنْ ‏ ‏إِسْرَائِيلَ بْنِ يُونُسَ ‏ ‏عَنْ ‏ ‏يُوسُفَ بْنِ أَبِي بُرْدَةَ ‏ ‏عَنْ ‏ ‏أَبِيهِ ‏ ‏عَنْ ‏ ‏عَائِشَةَ ‏ ‏رَضِيَ اللَّهُ عَنْهَا ‏ ‏قَالَتْ ‏ ‏كَانَ النَّبِيُّ ‏ ‏صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏ ‏إِذَا خَرَجَ مِنْ الْخَلَاءِ قَالَ ‏ ‏غُفْرَانَكَ ‏ ‏قَالَ ‏ ‏أَبُو عِيسَى ‏ ‏هَذَا ‏ ‏حَدِيثٌ حَسَنٌ غَرِيبٌ ‏ ‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ ‏ ‏إِسْرَائِيلَ ‏ ‏عَنْ ‏ ‏يُوسُفَ بْنِ أَبِي بُرْدَةَ ‏ ‏وَأَبُو بُرْدَةَ بْنُ أَبِي مُوسَى ‏ ‏اسْمُهُ ‏ ‏عَامِرُ بْنُ عَبْدِ اللَّهِ بْنِ قَيْسٍ الْأَشْعَرِيُّ ‏ ‏وَلَا نَعْرِفُ فِي هَذَا الْبَابِ إِلَّا حَدِيثَ ‏ ‏عَائِشَةَ ‏ ‏رَضِيَ اللَّهُ عَنْهَا ‏ ‏عَنْ النَّبِيِّ ‏ ‏صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏",
      type: "hadith",
      audio: "Audio_3",
    ),
    BookmarkModel(
      text:
          "اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.",
      type: "zhkar",
      audio: "Audio_4",
    ),
    BookmarkModel(
      text:
          "أُوْلَـٰٓئِكَ عَلَىٰ هُدٗى مِّن رَّبِّهِمۡۖ وَأُوْلَـٰٓئِكَ هُمُ ٱلۡمُفۡلِحُونَ",
      type: "surah",
      audio: "audios/quran_audio/002/005.mp3",
    ),
    BookmarkModel(
      text:
          "‏ ‏حَدَّثَنَا ‏ ‏قُتَيْبَةُ بْنُ سَعِيدٍ ‏ ‏حَدَّثَنَا ‏ ‏عَبْدُ السَّلَامِ بْنُ حَرْبٍ الْمُلَائِيُّ ‏ ‏عَنْ ‏ ‏الْأَعْمَشِ ‏ ‏عَنْ ‏ ‏أَنَسٍ ‏ ‏قَالَ ‏ ‏كَانَ النَّبِيُّ ‏ ‏صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏ ‏إِذَا أَرَادَ الْحَاجَةَ لَمْ يَرْفَعْ ثَوْبَهُ حَتَّى يَدْنُوَ مِنْ الْأَرْضِ ‏ ‏قَالَ ‏ ‏أَبُو عِيسَى ‏ ‏هَكَذَا ‏ ‏رَوَى ‏ ‏مُحَمَّدُ بْنُ رَبِيعَةَ ‏ ‏عَنْ ‏ ‏الْأَعْمَشِ ‏ ‏عَنْ ‏ ‏أَنَسٍ ‏ ‏هَذَا الْحَدِيثَ ‏ ‏وَرَوَى ‏ ‏وَكِيعٌ ‏ ‏وَأَبُو يَحْيَى الْحِمَّانِيُّ ‏ ‏عَنْ ‏ ‏الْأَعْمَشِ ‏ ‏قَالَ قَالَ ‏ ‏ابْنُ عُمَرَ ‏ ‏كَانَ النَّبِيُّ ‏ ‏صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏ ‏إِذَا أَرَادَ الْحَاجَةَ لَمْ يَرْفَعْ ثَوْبَهُ حَتَّى يَدْنُوَ مِنْ الْأَرْضِ ‏ ‏وَكِلَا الْحَدِيثَيْنِ مُرْسَلٌ ‏ ‏وَيُقَالُ لَمْ يَسْمَعْ ‏ ‏الْأَعْمَشُ ‏ ‏مِنْ ‏ ‏أَنَسٍ ‏ ‏وَلَا مِنْ أَحَدٍ مِنْ ‏ ‏أَصْحَابِ النَّبِيِّ ‏ ‏صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏ ‏وَقَدْ نَظَرَ إِلَى ‏ ‏أَنَسِ بْنِ مَالِكٍ ‏ ‏قَالَ ‏ ‏رَأَيْتُهُ ‏ ‏يُصَلِّي فَذَكَرَ عَنْهُ حِكَايَةً فِي الصَّلَاةِ ‏ ‏وَالْأَعْمَشُ ‏ ‏اسْمُهُ ‏ ‏سُلَيْمَانُ بْنُ مِهْرَانَ أَبُو مُحَمَّدٍ الْكَاهِلِيُّ ‏ ‏وَهُوَ مَوْلًى لَهُمْ ‏ ‏قَالَ ‏ ‏الْأَعْمَشُ ‏ ‏كَانَ أَبِي حَمِيلًا فَوَرَّثَهُ ‏ ‏مَسْرُوقٌ ‏",
      type: "hadith",
      audio: "Audio_6",
    ),
    BookmarkModel(
      text:
          "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.",
      type: "zhkar",
      audio: "Audio_7",
    ),
  ];
}
